You must Reload Latest before editing the element. Changes will be temporary, and will not be saved.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId TemporaryChangesOutOfDate { get; }
  Visual Basic
Public Shared ReadOnly Property TemporaryChangesOutOfDate As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ TemporaryChangesOutOfDate {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace